IDEA StatiCa Open Model
MprlRecord Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Parameter which represts the general record in IDEA MPRL
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Parameters.MprlRecord
 IdeaRS.OpenModel.Parameters.BoltParam
 IdeaRS.OpenModel.Parameters.CrossSectionParam
 IdeaRS.OpenModel.Parameters.MaterialParam
 IdeaRS.OpenModel.Parameters.WeldParam
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[SerializableAttribute]
public class MprlRecord
<SerializableAttribute>
Public Class MprlRecord
[SerializableAttribute]
public ref class MprlRecord
The MprlRecord type exposes the following members.
Constructors
Name | Description
MprlRecord
Initializes a new instance of the MprlRecord class
Top
Properties
Name | Description
ItemId
 Mprl ItemId
Name
 Name of the item
TableId
 Mprl TableId
Top
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace